/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   randomChump.cpp                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hurabe <hurabe@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/12/29 19:43:05 by hurabe            #+#    #+#             */
/*   Updated: 2024/12/30 21:52:01 by hurabe           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Zombie.hpp"

// スタックを使用して一時的なゾンビを作成する
void	randomChump(std::string name) {
	Zombie zombie(name);
	zombie.announce();
}
